[Survived] String mutation
todo-api-llm-gpt/TodoApi/Authentication/TokenService.cs:40:41
 
         var section = bearerSection.GetSection("SigningKeys:0");
 
-        var validIssuer = bearerSection["ValidIssuer"];
+        var validIssuer = bearerSection[""];
         _issuer = validIssuer ?? "dotnet-user-jwts";
         var value = section["Value"];
