[NoCoverage] Collection initializer mutation
todo-api-llm-gpt/TodoApi/Extensions/DescribeSwaggerExtensions.cs:12:31
     {
         public void Apply(OpenApiDocument swaggerDoc, DocumentFilterContext context)
         {
-            swaggerDoc.Tags = new List<OpenApiTag>
-            {
-                new OpenApiTag { Name = "Users", Description = "Users management operations" },
-                new OpenApiTag { Name = "Todos", Description = "Todo list management operations" },
-            };
+            swaggerDoc.Tags = new List<OpenApiTag>
+{};
         }
     }

[NoCoverage] String mutation
todo-api-llm-gpt/TodoApi/Extensions/DescribeSwaggerExtensions.cs:14:41
         {
             swaggerDoc.Tags = new List<OpenApiTag>
             {
-                new OpenApiTag { Name = "Users", Description = "Users management operations" },
+                new OpenApiTag { Name = "", Description = "Users management operations" },
                 new OpenApiTag { Name = "Todos", Description = "Todo list management operations" },
             };

[NoCoverage] Object initializer mutation
todo-api-llm-gpt/TodoApi/Extensions/DescribeSwaggerExtensions.cs:14:17
         {
             swaggerDoc.Tags = new List<OpenApiTag>
             {
-                new OpenApiTag { Name = "Users", Description = "Users management operations" },
+                new OpenApiTag {},
                 new OpenApiTag { Name = "Todos", Description = "Todo list management operations" },
             };

[NoCoverage] String mutation
todo-api-llm-gpt/TodoApi/Extensions/DescribeSwaggerExtensions.cs:15:64
             swaggerDoc.Tags = new List<OpenApiTag>
             {
                 new OpenApiTag { Name = "Users", Description = "Users management operations" },
-                new OpenApiTag { Name = "Todos", Description = "Todo list management operations" },
+                new OpenApiTag { Name = "Todos", Description = "" },
             };
         }

[NoCoverage] Object initializer mutation
todo-api-llm-gpt/TodoApi/Extensions/DescribeSwaggerExtensions.cs:15:17
             swaggerDoc.Tags = new List<OpenApiTag>
             {
                 new OpenApiTag { Name = "Users", Description = "Users management operations" },
-                new OpenApiTag { Name = "Todos", Description = "Todo list management operations" },
+                new OpenApiTag {},
             };
         }

[Survived] Object initializer mutation
todo-api-llm-gpt/TodoApi/Extensions/DescribeSwaggerExtensions.cs:53:26
 
         public static IEndpointConventionBuilder DescribeApiSecurityRequirement(this IEndpointConventionBuilder builder)
         {
-            var scheme = new OpenApiSecurityScheme()
-            {
-                Type = SecuritySchemeType.Http,
-                Name = JwtBearerDefaults.AuthenticationScheme,
-                Scheme = JwtBearerDefaults.AuthenticationScheme,
-                Reference = new()
-                {
-                    Type = ReferenceType.SecurityScheme,
-                    Id = JwtBearerDefaults.AuthenticationScheme
-                }
-            };
+            var scheme = new OpenApiSecurityScheme()
+{};
 
             return builder.WithOpenApi(operation => new(operation)

[Survived] String mutation
todo-api-llm-gpt/TodoApi/Extensions/DescribeSwaggerExtensions.cs:81:30
         {
             builder.WithOpenApi(o =>
              {
-                 o.Summary = "Authenticate user";
+                 o.Summary = "";
                  o.Description = "Generate a valid token to authenticate Todos endpoints by username and password.";
                  o.Responses["200"].Description = "Token generated successfully";

[Survived] String mutation
todo-api-llm-gpt/TodoApi/Extensions/DescribeSwaggerExtensions.cs:98:50
                 o.Summary = "Create an user";
                 o.Description = "This endpoint creates new user with an username and password.";
                 o.Responses["200"].Description = "User created successfully";
-                o.Responses["400"].Description = "Invalid fields or user already exists";
+                o.Responses["400"].Description = "";
                 return o;
             });

[Survived] String mutation
todo-api-llm-gpt/TodoApi/Extensions/DescribeSwaggerExtensions.cs:128:29
                 .Produces(401)
                 .WithOpenApi(o =>
             {
-                o.Summary = "Update a todo";
+                o.Summary = "";
                 o.Parameters[0].Description = "Id of an existing todo created by the user who owns the authentication token.";

[Survived] String mutation
todo-api-llm-gpt/TodoApi/Extensions/DescribeSwaggerExtensions.cs:150:47
             {
                 o.Summary = "Delete a todo";
                 o.Description = "This endpoint deletes an existing todo. It can only be done by the user who created the todo.";
-                o.Parameters[0].Description = "Id of an existing todo created by the user who owns the authentication token.";
+                o.Parameters[0].Description = "";
                 o.Parameters[0].AllowEmptyValue = false;
                 o.Responses["200"].Description = "Todo deleted successfully";

[Killed] String mutation
todo-api-llm-gpt/TodoApi/Extensions/DescribeSwaggerExtensions.cs:171:29
                 o.Description = "This endpoint list all existing todos that the user has created. If current user has no todos, an empty array will be returned.";
                 o.Responses["200"].Description = "Todos listed successfully";
                 o.Responses["401"].Description = "Invalid token or missing";
-                o.Responses["401"].Content = null;
+                o.Responses[""].Content = null;
                 return o;
             });
killedBy: TodoApi.IntegrationTests.UsersIntegrationTests.TC004_Create_User_With_Empty_Username_Returns_BadRequest; TodoApi.IntegrationTests.TodosIntegrationTests.TC020_Create_Todo_With_Long_Title_Returns_BadRequest

[Survived] String mutation
todo-api-llm-gpt/TodoApi/Extensions/DescribeSwaggerExtensions.cs:188:50
                 o.Description = "This endpoint consult an existing todo. It can only be done by the user who created the todo.";
                 o.Parameters[0].Description = "Id of an existing todo created by the user who owns the authentication token.";
                 o.Parameters[0].AllowEmptyValue = false;
-                o.Responses["200"].Description = "Todo consulted successfully";
+                o.Responses["200"].Description = "";
                 o.Responses["401"].Description = "Invalid token or missing";
                 o.Responses["404"].Description = "Todo does not exists or user is not the owner";

[Killed] String mutation
todo-api-llm-gpt/TodoApi/Extensions/DescribeSwaggerExtensions.cs:189:29
                 o.Parameters[0].Description = "Id of an existing todo created by the user who owns the authentication token.";
                 o.Parameters[0].AllowEmptyValue = false;
                 o.Responses["200"].Description = "Todo consulted successfully";
-                o.Responses["401"].Description = "Invalid token or missing";
+                o.Responses[""].Description = "Invalid token or missing";
                 o.Responses["404"].Description = "Todo does not exists or user is not the owner";
                 return o;
killedBy: TodoApi.IntegrationTests.UsersIntegrationTests.TC004_Create_User_With_Empty_Username_Returns_BadRequest; TodoApi.IntegrationTests.TodosIntegrationTests.TC020_Create_Todo_With_Long_Title_Returns_BadRequest
