[Survived] String mutation
todo-api-llm-gpt/TodoApi/Extensions/OpenTelemetryExtensions.cs:50:32
                            c.AddEventSources(
                                "Microsoft.AspNetCore.Hosting",
                                "Microsoft-AspNetCore-Server-Kestrel",
-                               "System.Net.Http",
+                               "",
                                "System.Net.Sockets",
                                "System.Net.NameResolution",

[Survived] String mutation
todo-api-llm-gpt/TodoApi/Extensions/OpenTelemetryExtensions.cs:52:32
                                "Microsoft-AspNetCore-Server-Kestrel",
                                "System.Net.Http",
                                "System.Net.Sockets",
-                               "System.Net.NameResolution",
+                               "",
                                "System.Net.Security");
                        });
