[Survived] String mutation
integration-test-generation-llm-efficiency/todo-api-llm-gpt/TodoApi/Program.cs:62:50
                 var context = services.GetRequiredService<TodoDbContext>();
 
                 var databaseConfig = new DatabaseConfig();
-                builder.Configuration.GetSection("Database").Bind(databaseConfig);
+                builder.Configuration.GetSection("").Bind(databaseConfig);
                 if (databaseConfig.Clear)
                 {

[NoCoverage] String mutation
integration-test-generation-llm-efficiency/todo-api-llm-gpt/TodoApi/Program.cs:73:37
             catch (Exception ex)
             {
                 var logger = services.GetRequiredService<ILogger<Program>>();
-                logger.LogError(ex, "Error to apply migrations");
+                logger.LogError(ex, "");
             }
         }

[Survived] String mutation
integration-test-generation-llm-efficiency/todo-api-llm-gpt/TodoApi/Program.cs:82:17
 
         app.UseRateLimiter();
 
-        app.Map("/", () => Results.Redirect("/swagger"));
+        app.Map("", () => Results.Redirect("/swagger"));
 
         // Configure the APIs
