[NoCoverage] String mutation
todo-api-llm-gpt/TodoApi/Migrations/20221123071234_Initial.cs:19:55
                 columns: table => new
                 {
                     Id = table.Column<string>(type: "TEXT", nullable: false),
-                    Name = table.Column<string>(type: "TEXT", maxLength: 256, nullable: true),
+                    Name = table.Column<string>(type: "", maxLength: 256, nullable: true),
                     NormalizedName = table.Column<string>(type: "TEXT", maxLength: 256, nullable: true),
                     ConcurrencyStamp = table.Column<string>(type: "TEXT", nullable: true)

[NoCoverage] String mutation
todo-api-llm-gpt/TodoApi/Migrations/20221123071234_Initial.cs:39:63
                     Email = table.Column<string>(type: "TEXT", maxLength: 256, nullable: true),
                     NormalizedEmail = table.Column<string>(type: "TEXT", maxLength: 256, nullable: true),
                     EmailConfirmed = table.Column<bool>(type: "INTEGER", nullable: false),
-                    PasswordHash = table.Column<string>(type: "TEXT", nullable: true),
+                    PasswordHash = table.Column<string>(type: "", nullable: true),
                     SecurityStamp = table.Column<string>(type: "TEXT", nullable: true),
                     ConcurrencyStamp = table.Column<string>(type: "TEXT", nullable: true),

[NoCoverage] String mutation
todo-api-llm-gpt/TodoApi/Migrations/20221123071234_Initial.cs:130:41
                     table.ForeignKey(
                         name: "FK_AspNetUserRoles_AspNetRoles_RoleId",
                         column: x => x.RoleId,
-                        principalTable: "AspNetRoles",
+                        principalTable: "",
                         principalColumn: "Id",
                         onDelete: ReferentialAction.Cascade);

[NoCoverage] String mutation
todo-api-llm-gpt/TodoApi/Migrations/20221123071234_Initial.cs:146:64
                 columns: table => new
                 {
                     UserId = table.Column<string>(type: "TEXT", nullable: false),
-                    LoginProvider = table.Column<string>(type: "TEXT", nullable: false),
+                    LoginProvider = table.Column<string>(type: "", nullable: false),
                     Name = table.Column<string>(type: "TEXT", nullable: false),
                     Value = table.Column<string>(type: "TEXT", nullable: true)

[NoCoverage] String mutation
todo-api-llm-gpt/TodoApi/Migrations/20221123071234_Initial.cs:168:59
                     Id = table.Column<int>(type: "INTEGER", nullable: false)
                         .Annotation("Sqlite:Autoincrement", true),
                     Title = table.Column<string>(type: "TEXT", nullable: false),
-                    IsComplete = table.Column<bool>(type: "INTEGER", nullable: false),
+                    IsComplete = table.Column<bool>(type: "", nullable: false),
                     OwnerId = table.Column<string>(type: "TEXT", nullable: false)
                 },

[NoCoverage] String mutation
todo-api-llm-gpt/TodoApi/Migrations/20221123071234_Initial.cs:184:24
 
             migrationBuilder.CreateIndex(
                 name: "IX_AspNetRoleClaims_RoleId",
-                table: "AspNetRoleClaims",
+                table: "",
                 column: "RoleId");
 

[NoCoverage] String mutation
todo-api-llm-gpt/TodoApi/Migrations/20221123071234_Initial.cs:190:25
             migrationBuilder.CreateIndex(
                 name: "RoleNameIndex",
                 table: "AspNetRoles",
-                column: "NormalizedName",
+                column: "",
                 unique: true);
 

[NoCoverage] String mutation
todo-api-llm-gpt/TodoApi/Migrations/20221123071234_Initial.cs:195:24
 
             migrationBuilder.CreateIndex(
                 name: "IX_AspNetUserClaims_UserId",
-                table: "AspNetUserClaims",
+                table: "",
                 column: "UserId");
 

[NoCoverage] String mutation
todo-api-llm-gpt/TodoApi/Migrations/20221123071234_Initial.cs:196:25
             migrationBuilder.CreateIndex(
                 name: "IX_AspNetUserClaims_UserId",
                 table: "AspNetUserClaims",
-                column: "UserId");
+                column: "");
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
todo-api-llm-gpt/TodoApi/Migrations/20221123071234_Initial.cs:199:23
                 column: "UserId");
 
             migrationBuilder.CreateIndex(
-                name: "IX_AspNetUserLogins_UserId",
+                name: "",
                 table: "AspNetUserLogins",
                 column: "UserId");
