[NoCoverage] String mutation
todo-api-llm-gpt/TodoApi/Migrations/20221123165051_RemoveIsAdmin.cs:23:24
         {
             migrationBuilder.AddColumn<bool>(
                 name: "IsAdmin",
-                table: "AspNetUsers",
+                table: "",
                 type: "INTEGER",
                 nullable: false,

[NoCoverage] String mutation
todo-api-llm-gpt/TodoApi/Migrations/20221123165051_RemoveIsAdmin.cs:24:23
             migrationBuilder.AddColumn<bool>(
                 name: "IsAdmin",
                 table: "AspNetUsers",
-                type: "INTEGER",
+                type: "",
                 nullable: false,
                 defaultValue: false);
