[Killed] String mutation
todo-api-original/TodoApi/Authentication/TokenService.cs:38:48
         //     }
         //   }
 
-        var section = bearerSection.GetSection("SigningKeys:0");
+        var section = bearerSection.GetSection("");
 
         var validIssuer = bearerSection["ValidIssuer"];
killedBy: TodoApi.Tests.UserApiTests.CanGetATokenForValidUser; TodoApi.Tests.TodoApiTests.DeleteTodos

[NoCoverage] String mutation
todo-api-original/TodoApi/Authentication/TokenService.cs:41:34
         var section = bearerSection.GetSection("SigningKeys:0");
 
         var validIssuer = bearerSection["ValidIssuer"];
-        _issuer = validIssuer ?? "dotnet-user-jwts";
+        _issuer = validIssuer ?? "";
         var value = section["Value"];
         var signingKeyBase64 = value ?? "DCmbsZQIbC0VT3xssf+mkrAhpnVPw/x38jYliIg7Oas=";

[Killed] String mutation
todo-api-original/TodoApi/Authentication/TokenService.cs:51:34
                 SecurityAlgorithms.HmacSha256Signature);
 
         _audiences = bearerSection.GetSection("ValidAudiences").GetChildren()
-                    .Where(s => !string.IsNullOrEmpty(s.Value))
+                    .Where(s => !(s.Value!=""))
                     .Select(s => new Claim(JwtRegisteredClaimNames.Aud, s.Value!))
                     .ToArray();
killedBy: TodoApi.Tests.UserApiTests.CanGetATokenForValidUser

[Survived] String mutation
todo-api-original/TodoApi/Authentication/TokenService.cs:63:67
         identity.AddClaim(new Claim(JwtRegisteredClaimNames.Sub, username));
 
         // REVIEW: Check that this logic is OK for jti claims
-        var id = Guid.NewGuid().ToString().GetHashCode().ToString("x", CultureInfo.InvariantCulture);
+        var id = Guid.NewGuid().ToString().GetHashCode().ToString("", CultureInfo.InvariantCulture);
 
         identity.AddClaim(new Claim(JwtRegisteredClaimNames.Jti, id));
