[Survived] String mutation
integration-test-generation-llm-efficiency/todo-api-original/TodoApi/Program.cs:25:86
         builder.Services.AddSingleton<ITokenService, TokenService>();
 
         // Configure the database
-        var connectionString = builder.Configuration.GetConnectionString("Todos") ?? "Data Source=.db/Todos.db";
+        var connectionString = builder.Configuration.GetConnectionString("Todos") ?? "";
         builder.Services.AddSqlite<TodoDbContext>(connectionString);
 

[Survived] Statement mutation
integration-test-generation-llm-efficiency/todo-api-original/TodoApi/Program.cs:65:17
                 var context = services.GetRequiredService<TodoDbContext>();
                 
                 var databaseConfig = new DatabaseConfig();
-                builder.Configuration.GetSection("Database").Bind(databaseConfig);
+                ;
                 if (databaseConfig.Clear)
                 {

[Survived] Negate expression
integration-test-generation-llm-efficiency/todo-api-original/TodoApi/Program.cs:66:21
                 
                 var databaseConfig = new DatabaseConfig();
                 builder.Configuration.GetSection("Database").Bind(databaseConfig);
-                if (databaseConfig.Clear)
+                if (!(databaseConfig.Clear))
                 {
                     context.Database.EnsureDeleted();

[Survived] Statement mutation
integration-test-generation-llm-efficiency/todo-api-original/TodoApi/Program.cs:68:21
                 builder.Configuration.GetSection("Database").Bind(databaseConfig);
                 if (databaseConfig.Clear)
                 {
-                    context.Database.EnsureDeleted();
+                    ;
                 }
 

[Survived] Statement mutation
integration-test-generation-llm-efficiency/todo-api-original/TodoApi/Program.cs:71:17
                     context.Database.EnsureDeleted();
                 }
 
-                context.Database.EnsureCreated();
+                ;
             }
             catch (Exception ex)

[NoCoverage] String mutation
integration-test-generation-llm-efficiency/todo-api-original/TodoApi/Program.cs:85:45
 
         app.UseRateLimiter();
 
-        app.Map("/", () => Results.Redirect("/swagger"));
+        app.Map("/", () => Results.Redirect(""));
 
         // Configure the APIs
