[Survived] String mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:29:29
             options.SwaggerDoc("v1",
                 new OpenApiInfo
                 {
-                    Title = "Simple Todo API",
+                    Title = "",
                     Description = "API to manage a simple Todo List with user auth control.",
                     Version = "v1",

[Survived] String mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:31:31
                 {
                     Title = "Simple Todo API",
                     Description = "API to manage a simple Todo List with user auth control.",
-                    Version = "v1",
+                    Version = "",
                     Contact = new OpenApiContact()
                     {

[Survived] Object initializer mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:32:31
                     Title = "Simple Todo API",
                     Description = "API to manage a simple Todo List with user auth control.",
                     Version = "v1",
-                    Contact = new OpenApiContact()
-                    {
-                        Name = "David Fowler",
-                        Url = new Uri("https://github.com/davidfowl"),
-                    },
+                    Contact = new OpenApiContact()
+{},
                     License = new OpenApiLicense()
                     {

[Survived] String mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:34:32
                     Version = "v1",
                     Contact = new OpenApiContact()
                     {
-                        Name = "David Fowler",
+                        Name = "",
                         Url = new Uri("https://github.com/davidfowl"),
                     },

[Survived] String mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:84:51
                  o.Summary = "Authenticate user";
                  o.Description = "Generate a valid token to authenticate Todos endpoints by username and password.";
                  o.Responses["200"].Description = "Token generated successfully";
-                 o.Responses["400"].Description = "Invalid credentials";
+                 o.Responses["400"].Description = "";
                  return o;
              });

[Survived] String mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:96:33
             builder.WithOpenApi(o =>
             {
                 o.Summary = "Create an user";
-                o.Description = "This endpoint creates new user with an username and password.";
+                o.Description = "";
                 o.Responses["200"].Description = "User created successfully";
                 o.Responses["400"].Description = "Invalid fields or user already exists";

[Killed] String mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:97:29
             {
                 o.Summary = "Create an user";
                 o.Description = "This endpoint creates new user with an username and password.";
-                o.Responses["200"].Description = "User created successfully";
+                o.Responses[""].Description = "User created successfully";
                 o.Responses["400"].Description = "Invalid fields or user already exists";
                 return o;
killedBy: TodoApi.Tests.UserApiTests.CanCreateAUser; TodoApi.Tests.UserApiTests.CanGetATokenForValidUser; TodoApi.Tests.UserApiTests.BadRequestForInvalidCredentials

[Survived] Statement mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:107:13
 
         public static RouteHandlerBuilder DescribeCreateTodo(this RouteHandlerBuilder builder)
         {
-            builder
-                .Produces(401)
-                .WithOpenApi(o =>
-            {
-                o.Summary = "Create a todo";
-                o.Description = "This endpoint creates new todo with a simple title (description) always incomplete.";
-                o.Responses["201"].Description = "Todo created successfully";
-                o.Responses["400"].Description = "Invalid title";
-                o.Responses["401"].Description = "Invalid token or missing";
-                return o;
-            });
+            ;
 
             return builder;

[Survived] String mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:111:29
                 .Produces(401)
                 .WithOpenApi(o =>
             {
-                o.Summary = "Create a todo";
+                o.Summary = "";
                 o.Description = "This endpoint creates new todo with a simple title (description) always incomplete.";
                 o.Responses["201"].Description = "Todo created successfully";

[Survived] String mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:112:33
                 .WithOpenApi(o =>
             {
                 o.Summary = "Create a todo";
-                o.Description = "This endpoint creates new todo with a simple title (description) always incomplete.";
+                o.Description = "";
                 o.Responses["201"].Description = "Todo created successfully";
                 o.Responses["400"].Description = "Invalid title";

[Killed] String mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:113:29
             {
                 o.Summary = "Create a todo";
                 o.Description = "This endpoint creates new todo with a simple title (description) always incomplete.";
-                o.Responses["201"].Description = "Todo created successfully";
+                o.Responses[""].Description = "Todo created successfully";
                 o.Responses["400"].Description = "Invalid title";
                 o.Responses["401"].Description = "Invalid token or missing";
killedBy: TodoApi.Tests.UserApiTests.CanCreateAUser; TodoApi.Tests.UserApiTests.CanGetATokenForValidUser; TodoApi.Tests.UserApiTests.BadRequestForInvalidCredentials

[Survived] String mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:115:50
                 o.Description = "This endpoint creates new todo with a simple title (description) always incomplete.";
                 o.Responses["201"].Description = "Todo created successfully";
                 o.Responses["400"].Description = "Invalid title";
-                o.Responses["401"].Description = "Invalid token or missing";
+                o.Responses["401"].Description = "";
                 return o;
             });

[Survived] String mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:130:47
             {
                 o.Summary = "Update a todo";
-                o.Parameters[0].Description = "Id of an existing todo created by the user who owns the authentication token.";
+                o.Parameters[0].Description = "";
                 o.Parameters[0].AllowEmptyValue = false;
                 o.Responses["200"].Description = "Todo updated successfully";

[Survived] String mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:134:50
                 o.Parameters[0].AllowEmptyValue = false;
                 o.Responses["200"].Description = "Todo updated successfully";
                 o.Responses["400"].Description = "Invalid title or missing isComplete";
-                o.Responses["401"].Description = "Invalid token or missing";
+                o.Responses["401"].Description = "";
                 o.Responses["404"].Description = "Todo does not exists or user is not the owner";
                 return o;

[Survived] Statement mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:144:13
 
         public static RouteHandlerBuilder DescribeDeleteTodo(this RouteHandlerBuilder builder)
         {
-            builder
-                .Produces(401)
-                .WithOpenApi(o =>
-            {
-                o.Summary = "Delete a todo";
-                o.Description = "This endpoint deletes an existing todo. It can only be done by the user who created the todo.";
-                o.Parameters[0].Description = "Id of an existing todo created by the user who owns the authentication token.";
-                o.Parameters[0].AllowEmptyValue = false;
-                o.Responses["200"].Description = "Todo deleted successfully";
-                o.Responses["401"].Description = "Invalid token or missing";
-                o.Responses["404"].Description = "Todo does not exists or user is not the owner";
-                return o;
-            });
+            ;
 
             return builder;

[Survived] String mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:148:29
                 .Produces(401)
                 .WithOpenApi(o =>
             {
-                o.Summary = "Delete a todo";
+                o.Summary = "";
                 o.Description = "This endpoint deletes an existing todo. It can only be done by the user who created the todo.";
                 o.Parameters[0].Description = "Id of an existing todo created by the user who owns the authentication token.";

[Survived] String mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:153:50
                 o.Parameters[0].Description = "Id of an existing todo created by the user who owns the authentication token.";
                 o.Parameters[0].AllowEmptyValue = false;
                 o.Responses["200"].Description = "Todo deleted successfully";
-                o.Responses["401"].Description = "Invalid token or missing";
+                o.Responses["401"].Description = "";
                 o.Responses["404"].Description = "Todo does not exists or user is not the owner";
                 return o;

[Survived] Statement mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:163:13
 
         public static RouteHandlerBuilder DescribeListTodos(this RouteHandlerBuilder builder)
         {
-            builder
-                .Produces(401, typeof(void))
-                .WithOpenApi(o =>
-            {
-                o.Summary = "List all todos";
-                o.Description = "This endpoint list all existing todos that the user has created. If current user has no todos, an empty array will be returned.";
-                o.Responses["200"].Description = "Todos listed successfully";
-                o.Responses["401"].Description = "Invalid token or missing";
-                o.Responses["401"].Content = null;
-                return o;
-            });
+            ;
 
             return builder;

[Survived] String mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:168:33
                 .WithOpenApi(o =>
             {
                 o.Summary = "List all todos";
-                o.Description = "This endpoint list all existing todos that the user has created. If current user has no todos, an empty array will be returned.";
+                o.Description = "";
                 o.Responses["200"].Description = "Todos listed successfully";
                 o.Responses["401"].Description = "Invalid token or missing";

[Killed] String mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:169:29
             {
                 o.Summary = "List all todos";
                 o.Description = "This endpoint list all existing todos that the user has created. If current user has no todos, an empty array will be returned.";
-                o.Responses["200"].Description = "Todos listed successfully";
+                o.Responses[""].Description = "Todos listed successfully";
                 o.Responses["401"].Description = "Invalid token or missing";
                 o.Responses["401"].Content = null;
killedBy: TodoApi.Tests.UserApiTests.CanCreateAUser; TodoApi.Tests.UserApiTests.CanGetATokenForValidUser; TodoApi.Tests.UserApiTests.BadRequestForInvalidCredentials

[Survived] String mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:169:50
             {
                 o.Summary = "List all todos";
                 o.Description = "This endpoint list all existing todos that the user has created. If current user has no todos, an empty array will be returned.";
-                o.Responses["200"].Description = "Todos listed successfully";
+                o.Responses["200"].Description = "";
                 o.Responses["401"].Description = "Invalid token or missing";
                 o.Responses["401"].Content = null;

[Killed] String mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:170:29
                 o.Summary = "List all todos";
                 o.Description = "This endpoint list all existing todos that the user has created. If current user has no todos, an empty array will be returned.";
                 o.Responses["200"].Description = "Todos listed successfully";
-                o.Responses["401"].Description = "Invalid token or missing";
+                o.Responses[""].Description = "Invalid token or missing";
                 o.Responses["401"].Content = null;
                 return o;
killedBy: TodoApi.Tests.UserApiTests.CanCreateAUser; TodoApi.Tests.UserApiTests.CanGetATokenForValidUser; TodoApi.Tests.UserApiTests.BadRequestForInvalidCredentials

[Survived] Statement mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:180:13
 
         public static RouteHandlerBuilder DescribeGetTodo(this RouteHandlerBuilder builder)
         {
-            builder
-                .Produces(401)
-                .WithOpenApi(o =>
-            {
-                o.Summary = "Get a todo";
-                o.Description = "This endpoint consult an existing todo. It can only be done by the user who created the todo.";
-                o.Parameters[0].Description = "Id of an existing todo created by the user who owns the authentication token.";
-                o.Parameters[0].AllowEmptyValue = false;
-                o.Responses["200"].Description = "Todo consulted successfully";
-                o.Responses["401"].Description = "Invalid token or missing";
-                o.Responses["404"].Description = "Todo does not exists or user is not the owner";
-                return o;
-            });
+            ;
 
             return builder;

[Killed] String mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:190:29
                 o.Parameters[0].AllowEmptyValue = false;
                 o.Responses["200"].Description = "Todo consulted successfully";
                 o.Responses["401"].Description = "Invalid token or missing";
-                o.Responses["404"].Description = "Todo does not exists or user is not the owner";
+                o.Responses[""].Description = "Todo does not exists or user is not the owner";
                 return o;
             });
killedBy: TodoApi.Tests.UserApiTests.CanCreateAUser; TodoApi.Tests.UserApiTests.CanGetATokenForValidUser; TodoApi.Tests.UserApiTests.BadRequestForInvalidCredentials

[Survived] String mutation
todo-api-original/TodoApi/Extensions/DescribeSwaggerExtensions.cs:190:50
                 o.Parameters[0].AllowEmptyValue = false;
                 o.Responses["200"].Description = "Todo consulted successfully";
                 o.Responses["401"].Description = "Invalid token or missing";
-                o.Responses["404"].Description = "Todo does not exists or user is not the owner";
+                o.Responses["404"].Description = "";
                 return o;
             });
