[Killed] Equality mutation
todo-api-original/TodoApi/Todos/TodoApi.cs:37:32
         {
             return await db.Todos.FindAsync(id) switch
             {
-                Todo todo when todo != null && todo.OwnerId == owner.Id
+                Todo todo when todo == null && todo.OwnerId == owner.Id
                               => TypedResults.Ok(todo.AsTodoItemResponse()),
                             _ => TypedResults.NotFound()
killedBy: TodoApi.Tests.TodoApiTests.CanOnlyGetTodosPostedBySameUser

[Killed] Object initializer mutation
todo-api-original/TodoApi/Todos/TodoApi.cs:46:24
 
         group.MapPost("/", async Task<Results<Created<TodoResponse>, BadRequest<BadRequestResponse>>> (TodoDbContext db, CreateTodoRequest newTodo, CurrentUser owner) =>
         {
-            var todo = new Todo
-            {
-                Title = newTodo.Title,
-                OwnerId = owner.Id
-            };
+            var todo = new Todo
+{};
 
             db.Todos.Add(todo);
killedBy: TodoApi.Tests.TodoApiTests.PostTodos

[Killed] Negate expression
todo-api-original/TodoApi/Todos/TodoApi.cs:62:17
         group.MapPut("/{id}", async Task<Results<Ok<TodoResponse>, NotFound, BadRequest<BadRequestResponse>>> (TodoDbContext db, int id, UpdateTodoRequest todo, CurrentUser owner) =>
         {
             var currentTodo = await db.Todos.FindAsync(id);
-            if (currentTodo != null && currentTodo.OwnerId == owner.Id)
+            if (!(currentTodo != null && currentTodo.OwnerId == owner.Id))
             {
                 var rowsAffected = await db.Todos.Where(t => t.Id == id && t.OwnerId == owner.Id)
killedBy: TodoApi.Tests.TodoApiTests.CanUpdateOwnedTodos

[Killed] Conditional (false) mutation
todo-api-original/TodoApi/Todos/TodoApi.cs:83:20
             var rowsAffected = await db.Todos.Where(t => t.Id == id && t.OwnerId == owner.Id)
                                              .ExecuteDeleteAsync();
 
-            return rowsAffected == 0 ? TypedResults.NotFound() : TypedResults.Ok();
+            return (false?TypedResults.NotFound() :TypedResults.Ok());
         })
         .DescribeDeleteTodo(); ;
killedBy: TodoApi.Tests.TodoApiTests.CannotDeleteUnownedTodos
