[Survived] String mutation
todo-api-original/TodoApi/Extensions/OpenTelemetryExtensions.cs:25:50
     public static WebApplicationBuilder AddOpenTelemetry(this WebApplicationBuilder builder)
     {
         var resourceBuilder = ResourceBuilder.CreateDefault().AddService(builder.Environment.ApplicationName);
-        var otlpEndpoint = builder.Configuration["OTEL_EXPORTER_OTLP_ENDPOINT"];
+        var otlpEndpoint = builder.Configuration[""];
 
         if (!string.IsNullOrWhiteSpace(otlpEndpoint))

[Survived] String mutation
todo-api-original/TodoApi/Extensions/OpenTelemetryExtensions.cs:48:32
                        {
                            // https://learn.microsoft.com/en-us/dotnet/core/diagnostics/available-counters
                            c.AddEventSources(
-                               "Microsoft.AspNetCore.Hosting",
+                               "",
                                "Microsoft-AspNetCore-Server-Kestrel",
                                "System.Net.Http",

[Survived] String mutation
todo-api-original/TodoApi/Extensions/OpenTelemetryExtensions.cs:51:32
                                "Microsoft.AspNetCore.Hosting",
                                "Microsoft-AspNetCore-Server-Kestrel",
                                "System.Net.Http",
-                               "System.Net.Sockets",
+                               "",
                                "System.Net.NameResolution",
                                "System.Net.Security");
