[NoCoverage] String mutation
todo-api-original/TodoApi/GenericResponse/BadRequestResponse.cs:9:44
     public class BadRequestResponse
     {
         [DefaultValue("https://tools.ietf.org/html/rfc7231#section-6.5.1")]
-        public string Type { get; set; } = "https://tools.ietf.org/html/rfc7231#section-6.5.1";
+        public string Type { get; set; } = "";
 
         [DefaultValue("One or more validation errors occurred.")]
