[NoCoverage] String mutation
todo-api-original/TodoApi/Migrations/20221123071234_Initial.cs:20:65
                 {
                     Id = table.Column<string>(type: "TEXT", nullable: false),
                     Name = table.Column<string>(type: "TEXT", maxLength: 256, nullable: true),
-                    NormalizedName = table.Column<string>(type: "TEXT", maxLength: 256, nullable: true),
+                    NormalizedName = table.Column<string>(type: "", maxLength: 256, nullable: true),
                     ConcurrencyStamp = table.Column<string>(type: "TEXT", nullable: true)
                 },

[NoCoverage] String mutation
todo-api-original/TodoApi/Migrations/20221123071234_Initial.cs:21:67
                     Id = table.Column<string>(type: "TEXT", nullable: false),
                     Name = table.Column<string>(type: "TEXT", maxLength: 256, nullable: true),
                     NormalizedName = table.Column<string>(type: "TEXT", maxLength: 256, nullable: true),
-                    ConcurrencyStamp = table.Column<string>(type: "TEXT", nullable: true)
+                    ConcurrencyStamp = table.Column<string>(type: "", nullable: true)
                 },
                 constraints: table =>

[NoCoverage] String mutation
todo-api-original/TodoApi/Migrations/20221123071234_Initial.cs:34:59
                 {
                     Id = table.Column<string>(type: "TEXT", nullable: false),
                     IsAdmin = table.Column<bool>(type: "INTEGER", nullable: false),
-                    UserName = table.Column<string>(type: "TEXT", maxLength: 256, nullable: false),
+                    UserName = table.Column<string>(type: "", maxLength: 256, nullable: false),
                     NormalizedUserName = table.Column<string>(type: "TEXT", maxLength: 256, nullable: true),
                     Email = table.Column<string>(type: "TEXT", maxLength: 256, nullable: true),

[NoCoverage] String mutation
todo-api-original/TodoApi/Migrations/20221123071234_Initial.cs:44:65
                     ConcurrencyStamp = table.Column<string>(type: "TEXT", nullable: true),
                     PhoneNumber = table.Column<string>(type: "TEXT", nullable: true),
                     PhoneNumberConfirmed = table.Column<bool>(type: "INTEGER", nullable: false),
-                    TwoFactorEnabled = table.Column<bool>(type: "INTEGER", nullable: false),
+                    TwoFactorEnabled = table.Column<bool>(type: "", nullable: false),
                     LockoutEnd = table.Column<DateTimeOffset>(type: "TEXT", nullable: true),
                     LockoutEnabled = table.Column<bool>(type: "INTEGER", nullable: false),

[NoCoverage] String mutation
todo-api-original/TodoApi/Migrations/20221123071234_Initial.cs:61:57
                 {
                     Id = table.Column<int>(type: "INTEGER", nullable: false)
                         .Annotation("Sqlite:Autoincrement", true),
-                    RoleId = table.Column<string>(type: "TEXT", nullable: false),
+                    RoleId = table.Column<string>(type: "", nullable: false),
                     ClaimType = table.Column<string>(type: "TEXT", nullable: true),
                     ClaimValue = table.Column<string>(type: "TEXT", nullable: true)

[NoCoverage] String mutation
todo-api-original/TodoApi/Migrations/20221123071234_Initial.cs:98:23
                 });
 
             migrationBuilder.CreateTable(
-                name: "AspNetUserLogins",
+                name: "",
                 columns: table => new
                 {

[NoCoverage] String mutation
todo-api-original/TodoApi/Migrations/20221123071234_Initial.cs:102:62
                 columns: table => new
                 {
                     LoginProvider = table.Column<string>(type: "TEXT", nullable: false),
-                    ProviderKey = table.Column<string>(type: "TEXT", nullable: false),
+                    ProviderKey = table.Column<string>(type: "", nullable: false),
                     ProviderDisplayName = table.Column<string>(type: "TEXT", nullable: true),
                     UserId = table.Column<string>(type: "TEXT", nullable: false)

[NoCoverage] String mutation
todo-api-original/TodoApi/Migrations/20221123071234_Initial.cs:108:38
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_AspNetUserLogins", x => new { x.LoginProvider, x.ProviderKey });
+                    table.PrimaryKey("", x => new { x.LoginProvider, x.ProviderKey });
                     table.ForeignKey(
                         name: "FK_AspNetUserLogins_AspNetUsers_UserId",

[NoCoverage] String mutation
todo-api-original/TodoApi/Migrations/20221123071234_Initial.cs:110:31
                 {
                     table.PrimaryKey("PK_AspNetUserLogins", x => new { x.LoginProvider, x.ProviderKey });
                     table.ForeignKey(
-                        name: "FK_AspNetUserLogins_AspNetUsers_UserId",
+                        name: "",
                         column: x => x.UserId,
                         principalTable: "AspNetUsers",

[NoCoverage] String mutation
todo-api-original/TodoApi/Migrations/20221123071234_Initial.cs:169:58
                         .Annotation("Sqlite:Autoincrement", true),
                     Title = table.Column<string>(type: "TEXT", nullable: false),
                     IsComplete = table.Column<bool>(type: "INTEGER", nullable: false),
-                    OwnerId = table.Column<string>(type: "TEXT", nullable: false)
+                    OwnerId = table.Column<string>(type: "", nullable: false)
                 },
                 constraints: table =>

[NoCoverage] String mutation
todo-api-original/TodoApi/Migrations/20221123071234_Initial.cs:175:31
                 {
                     table.PrimaryKey("PK_Todos", x => x.Id);
                     table.ForeignKey(
-                        name: "FK_Todos_AspNetUsers_OwnerId",
+                        name: "",
                         column: x => x.OwnerId,
                         principalTable: "AspNetUsers",

[NoCoverage] String mutation
todo-api-original/TodoApi/Migrations/20221123071234_Initial.cs:188:23
                 column: "RoleId");
 
             migrationBuilder.CreateIndex(
-                name: "RoleNameIndex",
+                name: "",
                 table: "AspNetRoles",
                 column: "NormalizedName",

[NoCoverage] String mutation
todo-api-original/TodoApi/Migrations/20221123071234_Initial.cs:189:24
 
             migrationBuilder.CreateIndex(
                 name: "RoleNameIndex",
-                table: "AspNetRoles",
+                table: "",
                 column: "NormalizedName",
                 unique: true);

[NoCoverage] String mutation
todo-api-original/TodoApi/Migrations/20221123071234_Initial.cs:194:23
                 unique: true);
 
             migrationBuilder.CreateIndex(
-                name: "IX_AspNetUserClaims_UserId",
+                name: "",
                 table: "AspNetUserClaims",
                 column: "UserId");

[NoCoverage] String mutation
todo-api-original/TodoApi/Migrations/20221123071234_Initial.cs:204:23
                 column: "UserId");
 
             migrationBuilder.CreateIndex(
-                name: "IX_AspNetUserRoles_RoleId",
+                name: "",
                 table: "AspNetUserRoles",
                 column: "RoleId");
