[Survived] Object initializer mutation
todo-api-original/TodoApi/Todos/TodoMappingExtensions.cs:28:16
 
     public static TodoResponse AsTodoItemResponse(this CreateTodoRequest todo, int id)
     {
-        return new TodoResponse()
-        {
-            Id = id,
-            Title = todo.Title,
-            IsComplete = false
-        };
+        return new TodoResponse()
+{};
     }
 }
